dbtoko/controllers/KasirController.php

INSERT INTO `kasir` (`id_kasir`, `jumlah`, `total_harga`, `id_produksi`, `id_transaksi`) VALUES (1, '5', 250000, 1, 2)
---
    public function actionCreate()
    {
        $model = new Kasir();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {

UPDATE `kasir` SET `id_kasir`=1, `total_harga`=25000, `id_produksi`=1, `id_transaksi`=1 WHERE `id_kasir`=1
---
    public function actionUpdate($id_kasir)
    {
        $model = $this->findModel($id_kasir);

        if ($this->request->isPost && $model->load($this->request->post()) && $model->save()) {

DELETE FROM `kasir` WHERE `id_kasir`=1
---
    public function actionDelete($id_kasir)
    {
        $this->findModel($id_kasir)->delete();

SELECT * FROM `kasir` WHERE `id_kasir`='1'
---
    protected function findModel($id_kasir)
    {
        if (($model = Kasir::findOne(['id_kasir' => $id_kasir])) !== null) {