dbtoko/controllers/SupplierController.php

    public function actionCreate()
    {
        $model = new Supplier();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {
---
INSERT INTO `supplier` (`nama`, `kontak`) VALUES ('momogi', '08975244312')

    protected function findModel($id_supplier)
    {
        if (($model = Supplier::findOne(['id_supplier' => $id_supplier])) !== null) {
---
SELECT * FROM `supplier` WHERE `id_supplier`='4'